chat_system_111145785_actor_description=Witch Helga.
chat_system_111145785_snap_5_question=^?^It's you again! Have you decided to amuse me with a little conversation?
chat_system_111145785_snap_5_answer_0=^?^I have something to discuss with you. Earl Argus asked me to go to you and get a Love Potion.
chat_system_111145785_snap_5_answer_1=^?^I'd like to take a look around - maybe you have something new for sale? 
chat_system_111145785_snap_5_answer_2=^?^Just came to say hello, but I must be on my way....
chat_system_111145785_snap_1_question=^?^Love Potion? There are several types of Love Potions. It depends on who you are, and especially who you want to enchant. You should know the age, color of the eyes and hair. Tell me a bit, and I'll choose the right one.
chat_system_111145785_snap_1_answer_0=^?^I'll tell you but don't be too surprised. Earl Argus wants to get married to an enchanted princess. He wants to get her by kissing a frog. But he wants her not to turn back into a frog again, so the earl must fall in love with her. That's why he needs a Love Potion.
chat_system_111145785_snap_2_question=^?^And why should I be surprised at that? Sounds perfectly reasonable to me! So anyway, he wants the potion for himself. And so his intended will be a green-skinned, goggle-eyed and hairless...<br>Well... Now. Here it is! For goggle-eyed! Take it, the perfect potion; there should be no side effects on humans.
chat_system_111145785_snap_2_answer_0=^?^How can I thank you?
chat_system_111145785_snap_3_question=^?^You know, darling, I am just so glad to see you. People come by here very rarely, especially people as polite as you.<br>And the earl is a good man too. He doesn't take money from me. So, I will not take money from him either.
chat_system_111145785_snap_3_answer_0=^?^You have a kind soul, Helga. Thank you.
chat_system_111145785_snap_0_question=^?^Guests! I have guests! How did you get here, [player]?
chat_system_111145785_snap_0_answer_0=^?^It was difficult to get here. It's a really... good place you chose for your home. Are you hiding from anybody in the backwoods out here?
chat_system_111145785_snap_0_answer_1=^?^I have something to discuss with you. Earl Argus asked me to go to you and get a Love Potion.
chat_system_111145785_snap_4_question=^?^Well... It's just that snakes understand me better than people do. I adore snakes, they are the most tender and kindest creatures in the world.<br>People say that I am an ugly person. I endured their meanness long enough. And thanks to snakes I know a great deal about poisons, better than any witch in the kingdom, and even better than any assassin, ha-ha. Do you want to try my potions?
chat_system_111145785_snap_4_answer_0=^?^Thanks for the offer. Do you have anything else for sale? Let me see.
chat_system_111145785_snap_4_answer_1=^?^Ok, I'll see you next time I come out this way. Good luck.
chat_system_111145785_snap_5_answer_3=^?^Do you need any snake eggs?
chat_system_111145785_snap_5_answer_4=^?^About the snake eggs...
chat_system_111145785_snap_6_question=^?^I sure do! And I know just the thing to trade for them!
chat_system_111145785_snap_6_answer_0=^?^Really?! What would you like in return for some snake eggs?
chat_system_111145785_snap_7_question=^?^I've got a collection of crystals that I've been wanting to trade for something valuable. I was thinking of exchanging 1 Crystal for every 60 Snake Eggs you bring me. Does that sound reasonable?
chat_system_111145785_snap_7_answer_0=^?^I think that sounds like a great deal! Let me go find some eggs...
chat_system_111145785_snap_7_answer_1=^?^I think that sounds like a great deal! I've got some eggs on me, let's see if we can trade...
chat_system_111145785_snap_8_question=^?^So you've got eggs to trade?
chat_system_111145785_snap_8_answer_0=^?^No, I just wanted to see the exchange rate.
chat_system_111145785_snap_8_answer_1=^?^I have some, but I don't have enough.
chat_system_111145785_snap_8_answer_2=^?^[img_crystal] Receive 1 Magic Crystal for 60 Snake Eggs.
chat_system_111145785_snap_8_answer_3=^?^[img_crystal] Receive 2 Magic Crystals for 120 Snake Eggs.
chat_system_111145785_snap_8_answer_4=^?^[img_crystal] Receive 5 Magic Crystals for 300 Snake Eggs.
chat_system_111145785_snap_8_answer_5=^?^[img_crystal] Receive 10 Magic Crystals for 600 Snake Eggs.
chat_system_111145785_snap_8_answer_6=^?^You know, I've changed my mind, show me your shop...
chat_system_111145785_snap_8_answer_7=^?^You know, I've gotta go...
chat_system_111145785_snap_9_question=^?^That's okay, dear. I'm sure you'll find enough soon... Don't forget, you need at least 60 eggs to trade!
chat_system_111145785_snap_9_answer_0=^?^Yah, let me get back to searching...
chat_system_111145785_snap_10_question=^?^Here's your Crystal and thanks for the Eggs!
chat_system_111145785_snap_10_answer_0=^?^Let's get back to trading...
chat_system_111145785_snap_10_answer_1=^?^I've gotta go...
chat_system_111145785_snap_11_question=^?^Here are your Crystals and thanks for the Eggs!
chat_system_111145785_snap_11_answer_0=^?^Let's get back to trading...
chat_system_111145785_snap_11_answer_1=^?^I've gotta go...
chat_system_111145785_snap_12_question=^?^That's okay, dear. I know you'll find some... Don't forget, you need at least 60 eggs to trade!
chat_system_111145785_snap_12_answer_0=^?^Yah, let me go find some...
